# Introdution to pandas

numpy is great for numerical data.

pandas is designed for manipulating mixtures of data types in tabular formats (much like Excel spreadsheets).

This Jupyter notebook provides only an overview of basic pandas functionality.  For more detailed information, here are a few good resources:
	
- “Python Data Science Handbook: Essential Tools for Working with Data” by Jake VanderPlas
- “Python for Data Analysis: Data Wrangling with Pandas, NumPy, and IPython 2nd Edition” by Wes McKinney (the creator of pandas)
- https://realpython.com/python-data-cleaning-numpy-pandas/
		
---

### Outline:
- Series vs. DataFrame

- Working with Series
	- creating a Series
	- indices
	- filtering
	
- Working with DataFrames
	- creating a DataFrame
	- indices
	- filtering
	
- Importing data from .csv

- Exporting to .csv

---

- Examples (in a separate Jupyter notebook):
    - In-class Exercise
    - Daily Show Guests
	- Scraping HTML Data
    
---

In [54]:
import pandas as pd
import numpy as np

## Series

A pandas "Series" is a one-dimensional object, like an array.

In [55]:
mySeries1 = pd.Series([8, 3 , -6, 7])
mySeries1

0    8
1    3
2   -6
3    7
dtype: int64

- The left column shows the "indices".  By default, these will run from 0 to (number of entries - 1). 

- The right column shows the "values".

In [56]:
# We can extract just the values:
mySeries1.values

array([ 8,  3, -6,  7], dtype=int64)

In [57]:
# We can also look at the indices:
mySeries1.index

RangeIndex(start=0, stop=4, step=1)

- This is like range(0,len(mySeries1))

One useful pandas feature is that we can define custom indices:

In [58]:
mySeries2 = pd.Series([8, 3, -6, 7], index=['c', 'a', 'b', 'xyz'])
mySeries2

c      8
a      3
b     -6
xyz    7
dtype: int64

Take a look at the 3rd row:

In [59]:
# We can use the index name:
mySeries2['b']

-6

In [60]:
# This is the same as above, but uses the index number
mySeries2[2]

-6

In [61]:
# Filter for values > 1:
mySeries2[mySeries2 > 1]

c      8
a      3
xyz    7
dtype: int64

In [62]:
# We can create a Series from a python dictionary:
myDict = {'HW1': 90, 'Exam 1': 77, 'Project': 88, 'HW2': 66}

mySeries3 = pd.Series(myDict)
mySeries3

HW1        90
Exam 1     77
Project    88
HW2        66
dtype: int64

- Note that, by default, pandas sorts by key/index

In [63]:
# We can provide an explicit ordering of indices:
assignments = ['HW1', 'HW2', 'HW3', 'Exam 1', 'Project']
mySeries4 = pd.Series(myDict, index=assignments)
mySeries4

HW1        90.0
HW2        66.0
HW3         NaN
Exam 1     77.0
Project    88.0
dtype: float64

- Note that index 'HW3' doesn't appear in myDict.  "NaN" stands for "Not a Number"; it represents a null/missing value.

In [64]:
pd.isnull(mySeries4)

HW1        False
HW2        False
HW3         True
Exam 1     False
Project    False
dtype: bool

In [65]:
pd.notnull(mySeries4)

HW1         True
HW2         True
HW3        False
Exam 1      True
Project     True
dtype: bool

In [66]:
# If you want to check which is the missing data, you can do this instead:
mySeries4[pd.isnull(mySeries4)]

HW3   NaN
dtype: float64

In [67]:
mySeries4[pd.isnull(mySeries4)].index

Index(['HW3'], dtype='object')

#### We can give a Series a name:

In [68]:
# Here's the original:
mySeries1

0    8
1    3
2   -6
3    7
dtype: int64

In [69]:
# Now we've given the series a name:
mySeries1.name = 'my numbers'
mySeries1

0    8
1    3
2   -6
3    7
Name: my numbers, dtype: int64

#### We can also change the indices:

In [70]:
mySeries1.index = ['a', 'x', 'b', 'z']
mySeries1

a    8
x    3
b   -6
z    7
Name: my numbers, dtype: int64

### Series Indexing

In [71]:
mySeries5 = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd']) # 4. makes the series float, if we use '4', it will be int
mySeries5

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [72]:
# We can use the row numbers:
mySeries5[1:2]

b    1.0
dtype: float64

In [73]:
mySeries5[1:3]

b    1.0
c    2.0
dtype: float64

- Note that [1:3] only shows rows with indices 1 and 2 (3 is ignored)

In [74]:
# We can also use the index labels:
mySeries5['b':'c']

b    1.0
c    2.0
dtype: float64

- **Note that 'c' is included in the output when we use index labels.**

## DataFrame

A pandas "DataFrame" represents a table of data.

Unlike a numpy ndarray, each column in a pandas DataFrame can contain a different type of data.

*This example comes from Wes McKinney's book.*

In [75]:
# Suppose we already have some data in the form of a dictionary:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
		'year': [2000, 2001, 2002, 2001, 2002, 2003], 
		'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [76]:
# Convert this to a pandas DataFrame:
frame1 = pd.DataFrame(data)
frame1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [77]:
# Look at the first 5 rows:
frame1.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [78]:
# Look at the last 5 rows:
frame1.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [79]:
# We can specify the order in which columns are displayed:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [80]:
# Let's create another dataframe.
# We've added a new column (debt).
# We've also specified the index names.
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
			index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [81]:
# Assign a scalar value to all rows in a given column:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [82]:
# Assign the values of a column via a list or array:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [83]:
# The following won't work because the list doesn't match the number of rows in frame2:
frame2['debt'] = np.arange(7)
frame2['debt'] = np.arange(3)

ValueError: Length of values does not match length of index

In [84]:
# However, if we assign a pandas Series to a DataFrame column, pandas will fill in the gaps with NaN:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [85]:
# Add a new column:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [86]:
# Remove a column:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

### DataFrame Indexing

In [87]:
# Get a list of all columns:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [88]:
# Retrieving a specific column:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [89]:
# Retrieving a specific row:
# a) by row index name, using "loc"
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [90]:
frame2.loc['one':'four']			# Note that 'four' is included, gets the rows one to four.

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5

In [91]:
frame2.loc[['one', 'four']] # This one will only give you 'one' and 'four'

      year   state  pop  debt
one   2000    Ohio  1.5   NaN
four  2001  Nevada  2.4  -1.5

In [92]:
# b) by row index ID, using "iloc"
frame2.iloc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [93]:
frame2.iloc[0:3]			# Note that 'four' is NOT included, just like a regular range (0 is one, etc, and 3 is not including it)

       year state  pop  debt
one    2000  Ohio  1.5   NaN
two    2001  Ohio  1.7  -1.2
three  2002  Ohio  3.6   NaN

In [94]:
frame2.iloc[[0, 3]] # Can be a good exam question, if you're using indices, 3 is not included here

      year   state  pop  debt
one   2000    Ohio  1.5   NaN
four  2001  Nevada  2.4  -1.5

In [95]:
# Select a subset of rows and columns:
frame2.loc['one', ['year', 'pop']]

year    2000
pop      1.5
Name: one, dtype: object

In [96]:
frame2.loc['one', 'year':'pop'] # Gets the year to pop data for row 'one'

year     2000
state    Ohio
pop       1.5
Name: one, dtype: object

In [97]:
frame2.loc['one':'three', 'year':'pop'] # Gets the data of year to pop for row 'one to 'three

       year state  pop
one    2000  Ohio  1.5
two    2001  Ohio  1.7
three  2002  Ohio  3.6

#### Caution:  Integer indices can be ambiguous:

In [98]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [99]:
ser[-1]        # This throws an error

KeyError: -1

In [104]:
ser.iloc[-1]      # Using iloc removes the ambiguity

2.0

In [105]:
# iloc uses the integer index, using loc if you want the actual index

#### It's safer to assign non-integer indices:

In [106]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

### Sorting Series

In [107]:
mySeries = pd.Series([3, 9, -5, 2])
mySeries

0    3
1    9
2   -5
3    2
dtype: int64

In [108]:
# sort_values() goes in ascending order by default:
mySeries.sort_values()

2   -5
3    2
0    3
1    9
dtype: int64

In [109]:
# We can force descending order:
mySeries.sort_values(ascending=False)

1    9
0    3
3    2
2   -5
dtype: int64

### Sorting DataFrames

In [121]:
myFrame = pd.DataFrame([[3, 11, 7], [2, 9, 4]], index=['a', 'b'], columns=['x', 'y', 'z'])
myFrame

   x   y  z
a  3  11  7
b  2   9  4

In [124]:
# Sort by column 'x', in ascending order (default):
myFrame.sort_values(by=['x', 'y'])

   x   y  z
b  2   9  4
a  3  11  7

In [125]:
# Sort by column 'x', in descending order:
myFrame.sort_values(by=['x'], ascending=False)

   x   y  z
a  3  11  7
b  2   9  4

In [126]:
myFrame.sort_values?

## Importing Data from .csv

#### First, suppose we have a .csv file, named "example_with_header.csv".

In [128]:
#cat example_with_header.csv     # For Mac/Linux
!type example_with_header.csv    # For Windows

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

example_with_header.csv


The system cannot find the file specified.
Error occurred while processing: #.
The system cannot find the file specified.
Error occurred while processing: For.
The system cannot find the file specified.
Error occurred while processing: Windows.

In [129]:
# Option 1:  Use "read_csv()"
df = pd.read_csv('example_with_header.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [130]:
# Option 2:  Use "read_table()" and specify the delimiter:
pd.read_table('example_with_header.csv', sep=",")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [131]:
# Read and understand the difference between read_csv and read_table
# read_csv is designed if you already have a comma-separated file (csv)
# read_table is for a more generic file where you can specify what the separator is by delimiter

#### Now, suppose our file doesn't have a header row.

In [132]:
# cat example_without_header.csv     # For Mac/Linux
!type example_without_header.csv    # For Windows

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

example_without_header.csv


The system cannot find the file specified.
Error occurred while processing: #.
The system cannot find the file specified.
Error occurred while processing: For.
The system cannot find the file specified.
Error occurred while processing: Windows.

In [134]:
# Option 1:  Use "read_csv()" and let pandas assign column names:
pd.read_csv('example_without_header.csv', header=None)

# We need to specify header=None or else it will assume the 1st row is the header

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [135]:
# Option 2: Use "read_csv()" and explicitly assign column names:
pd.read_csv('example_without_header.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [136]:
# Option 3:  Use "read_table()" and assign column names:
pd.read_table('example_without_header.csv', sep=",", names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

#### Now, suppose we want the last column to actually be our index

In [137]:
df2 = pd.read_csv('example_without_header.csv', names=['a', 'b', 'c', 'd', 'message'], index_col='message')
df2

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [138]:
df2.loc['world']

a    5
b    6
c    7
d    8
Name: world, dtype: int64

## Exporting DataFrame to .csv

In [139]:
# Here's our original DataFrame:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [140]:
# By default, "to_csv()" also includes the index:
df.to_csv('out1.csv')

In [143]:
#!cat out1.csv
!type out1.csv

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

In [142]:
# Now, if we re-read this .csv, we get an extra column:
pd.read_csv('out1.csv')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [ ]:
# Instead, we can specify that we don't want to export the index:
df.to_csv('out2.csv', index=False)

In [ ]:
!cat out2.csv
#!type out2.csv

In [ ]:
pd.read_csv('out2.csv')